app/views/post/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    <div>
      <h4><%= post.title %><%= "- #{User.find(post.user_id).name}" if logged_in? %></h4>