app/helpers/sessions_helper.rb

    def sign_in(user)
        remember_token = User.new_remember_token
        cookies.permanent[:remember_token] = remember_token
        user.update_attribute(:remember_token, User.digest(remember_token))
---
UPDATE "users" SET "updated_at" = ?, "remember_token" = ? WHERE "users"."id" = ?  [["updated_at", "2019-08-08 22:05:05.308272"], ["remember_token", "b89727d79766a20fc9a4b418456bc7c82c3afd30"], ["id", 2]]

    def current_user
        remember_token = User.digest(cookies[:remember_token])
        @current_user ||= User.find_by(remember_token: remember_token)
---
SELECT  "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "7e197d370c98b66e4f9e5431bb5a2acd143a58e0"], ["LIMIT", 1]]