app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "hello 566"], ["content", "jkhjhbvbhyg"], ["created_at", "2019-08-08 22:37:23.522901"], ["updated_at", "2019-08-08 22:37:23.522901"], ["user_id", 5]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save