app/controllers/posts_controller.rb

  def create
    @user = User.find_by(id: params[:user_id])
    @post = @user.posts.new(post_params)
    if @post.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "the"], ["content", "hjsjghjd sdfjhg"], ["created_at", "2019-08-08 22:24:31.249552"], ["updated_at", "2019-08-08 22:24:31.249552"], ["user_id", 1]]

  def find_post
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]