app/controllers/post_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Test1"], ["content", "This is a post"], ["created_at", "2019-08-06 21:05:05.509589"], ["updated_at", "2019-08-06 21:05:05.509589"], ["user_id", 5]]
---
  def create
    @post = Post.new(post_params)
    if @post.save